### 🔍 Infrastructure Validation Report

<details>
<summary>📋 Terraform Plan Insights 📋</summary>

```terraform
[command]/home/runner/work/_temp/135d0dcc-a01d-4a42-95fe-8dae50cbfdb0/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = <<-EOT
            [web_servers]
            44.222.163.23 ansible_user=ubuntu ansible_ssh_private_key_file=./devops-dojo
            
            [all:vars]
            ansible_python_interpreter=/usr/bin/python3
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../ansible/inventory.ini"
      + id                   = (known after apply)
    }

  # local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./devops-dojo"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.ansible_inventory will be created%0A  + resource "local_file" "ansible_inventory" {%0A      + content              = <<-EOT%0A            [web_servers]%0A            44.222.163.23 ansible_user=ubuntu ansible_ssh_private_key_file=./devops-dojo%0A            %0A            [all:vars]%0A            ansible_python_interpreter=/usr/bin/python3%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "../ansible/inventory.ini"%0A      + id                   = (known after apply)%0A    }%0A%0A  # local_file.private_key will be created%0A  + resource "local_file" "private_key" {%0A      + content              = (sensitive value)%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0600"%0A      + filename             = "./devops-dojo"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>

<details>
<summary>💰 Cost Estimation Overview 💰</summary>

```
Project: main

 Name                                                       Monthly Qty  Unit                  Monthly Cost   
                                                                                                              
 aws_instance.ec2                                                                                             
 ├─ Instance usage (Linux/UNIX, on-demand, t3.medium)               730  hours                       $30.37   
 └─ root_block_device                                                                                         
    └─ Storage (general purpose SSD, gp2)                             8  GB                           $0.80   
                                                                                                              
 aws_route53_record.main_domain_record                                                                        
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 aws_route53_record.wildcard_domain_record                                                                    
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 OVERALL TOTAL                                                                                      $31.17 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
10 cloud resources were detected:
∙ 3 were estimated
∙ 7 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃           $31 ┃           - ┃        $31 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛

```
</details>

*Analysis triggered by @Afeez-AA*